In [73]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [74]:
a = pd.read_csv("testing")

In [75]:
b = pd.read_csv("training")

In [76]:
l = [a,b]

In [77]:
df = pd.concat(l)

In [78]:
df = df.drop(columns="Unnamed: 0")

In [79]:
df.shape

(74228, 12)

In [80]:
df["Duration"].mode()[0]

'4 Years'

In [81]:
m[0]

'4 Years'

In [82]:
df.isnull().sum()

Institute        0
Quota            0
Seat Type        0
Gender           0
Opening          0
Closing          0
Round            0
Year             0
Duration       666
Degree           0
Branch           0
Avg_ranking      0
dtype: int64

In [83]:
df.isnull().sum().sum()

666

In [84]:
df.fillna(df["Duration"].mode()[0], inplace=True)

In [35]:
df.duplicated().sum()

42

In [36]:
df.drop_duplicates(inplace=True)

In [37]:
df.describe()

            Opening       Closing         Round          Year   Avg_ranking
count  74186.000000  74186.000000  74186.000000  74186.000000  74186.000000
mean    2524.394899   2969.715485      3.579638   2020.102203   2742.418435
std     3402.400223   3839.125637      1.907789      1.459891   3540.589872
min        1.000000      1.000000      1.000000   2018.000000      1.000000
25%      417.000000    553.000000      2.000000   2019.000000    515.500000
50%     1250.000000   1543.000000      3.000000   2020.000000   1427.500000
75%     3109.000000   3645.750000      5.000000   2021.000000   3391.000000
max    28872.000000  29247.000000      7.000000   2023.000000  28872.000000

In [38]:
df.columns

Index(['Institute', 'Quota', 'Seat Type', 'Gender', 'Opening', 'Closing',
       'Round', 'Year', 'Duration', 'Degree', 'Branch', 'Avg_ranking'],
      dtype='object')

In [40]:
Institute = pd.DataFrame(df["Institute"].unique())
Institute

                                                0
0           Indian Institute of Technology Bombay
1           Indian Institute of Technology Kanpur
2        Indian Institute of Technology Kharagpur
3           Indian Institute of Technology Madras
4    Indian Institute of Technology (ISM) Dhanbad
5          Indian Institute of Technology Roorkee
6   Indian Institute of Technology (BHU) Varanasi
7      Indian Institute of Technology Gandhinagar
8        Indian Institute of Technology Hyderabad
9          Indian Institute of Technology Jodhpur
10           Indian Institute of Technology Mandi
11        Indian Institute of Technology Guwahati
12         Indian Institute of Technology Dharwad
13           Indian Institute of Technology Delhi
14     Indian Institute of Technology Bhubaneswar
15          Indian Institute of Technology Indore
16           Indian Institute of Technology Jammu
17        Indian Institute of Technology Palakkad
18           Indian Institute of Technology Ropar
19        Indian Institute of Technology Tirupati
20          Indian Institute of Technology Bhilai
21             Indian Institute of Technology Goa

In [41]:
Quota = pd.DataFrame(df["Quota"].unique())
Quota

    0
0  AI

In [42]:
Seat_Type = pd.DataFrame(df["Seat Type"].unique())
Seat_Type

               0
0           OPEN
1     OPEN (PwD)
2            EWS
3        OBC-NCL
4  OBC-NCL (PwD)
5             SC
6             ST
7       SC (PwD)
8      EWS (PwD)
9       ST (PwD)

In [43]:
Gender = pd.DataFrame(df["Gender"].unique())
Gender

                                       0
0                         Gender-Neutral
1  Female-only (including Supernumerary)

In [44]:
Round = pd.DataFrame(df["Round"].unique())
Round

     0
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0

In [45]:
Year = pd.DataFrame(df["Year"].unique())
Year

      0
0  2023
1  2018
2  2019
3  2020
4  2021
5  2022

In [46]:
Duration = pd.DataFrame(df["Duration"].unique())
Duration

         0
0  4 Years
1  5 Years

In [47]:
Degree = pd.DataFrame(df["Degree"].unique())
Degree

                                   0
0             Bachelor of Technology
1     Bachelor and Master of Science
2  Bachelor and Master of Technology
3                Bachelor of Science
4           Bachelor of Architecture
5  Bachelor ans Master of Technology
6       Integrated Master of Science

In [48]:
Branch = pd.DataFrame(df["Branch"].unique())
Branch

                                                     0
0                                Aerospace Engineering
1                           Aerospace Engineering Dual
2                    Agricultural and Food Engineering
3    Agricultural and Food Engineering with M.Tech....
4                                      Applied Geology
..                                                 ...
99   Metallurgical Engineering and Materials_Scienc...
100  Metallurgical Engineering and Materials Scienc...
101                                Mineral Engineering
102                    Polymer Science and Engineering
103       Quality Engineering Design and Manufacturing

[104 rows x 1 columns]